backend-api/app/controllers/companies_controller.rb

    def create
        @company = Company.create(company_params)
---
INSERT INTO "companies" ("id", "Name", "Symbol", "Industry", "Country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def destroy
        @company = Company.find(params[:id])
        if @company.present?
            @company.destroy
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 2]]